<?php

return array (
  'accepted' => 'the: وصف کو قبول کرنا ضروری ہے۔',
  'active_url' => ': وصف ایک درست URL نہیں ہے۔',
  'after' => ': انتساب ایک تاریخ: تاریخ کے بعد ہونا چاہئے۔',
  'after_or_equal' => ': انتساب ایک تاریخ کے بعد یا اس کے مساوی ہونا چاہئے۔',
  'alpha' => ': وصف میں صرف حرف ہوسکتے ہیں۔',
  'alpha_dash' => ': خصوصیت میں صرف حرف ، نمبر ، ڈیش اور انڈر سکور ہوسکتے ہیں۔',
  'alpha_num' => ': خصوصیت میں صرف حرف اور نمبر شامل ہوسکتے ہیں۔',
  'array' => ': خصوصیت ایک صف ہونا چاہئے۔',
  'before' => ': انتساب ایک تاریخ سے پہلے کی تاریخ کا ہونا چاہئے۔',
  'before_or_equal' => ': انتساب ایک تاریخ سے پہلے یا اس کے مساوی ہونا چاہئے۔',
  'between' => 
  array (
    'array' => ': خاصیت کے درمیان ہونا چاہئے: کم سے کم اور: زیادہ سے زیادہ آئٹمز۔',
    'file' => ': خاصیت کا درمیان ہونا چاہئے: کم سے کم اور: زیادہ سے زیادہ کلو بائٹ۔',
    'numeric' => ': خاصیت کا درمیان ہونا چاہئے: کم سے کم اور: زیادہ سے زیادہ۔',
    'string' => ': خاصیت کا ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ حروف۔',
  ),
  'boolean' => ': خصوصیت کا فیلڈ صحیح یا غلط ہونا چاہئے۔',
  'confirmed' => ': انتساب کی توثیق مماثل نہیں ہے۔',
  'custom' => 
  array (
    'attribute-name' => 
    array (
      'rule-name' => 'کسٹم پیغام',
    ),
  ),
  'date' => ': وصف ایک درست تاریخ نہیں ہے۔',
  'date_equals' => ': انتساب کی تاریخ اس کے برابر ہونی چاہئے۔',
  'date_format' => ': انتساب فارمیٹ: فارمیٹ سے مماثل نہیں ہے۔',
  'different' => ': اوصاف اور: دوسرا مختلف ہونا چاہئے۔',
  'digits' => 'ہندسہ: ہندسہ ہونا چاہئے۔',
  'digits_between' => ': خاصیت کا ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ ہندسے۔',
  'dimensions' => ': وصف میں غلط تصویری جہتیں ہیں۔',
  'distinct' => ': خصوصیت کے فیلڈ میں ایک ڈپلیکیٹ ویلیو ہے۔',
  'email' => ': وصف ایک درست ای میل پتہ ہونا چاہئے۔',
  'exists' => 'منتخب کردہ: وصف غلط ہے۔',
  'file' => ': خصوصیت ایک فائل ہونی چاہئے۔',
  'filled' => ': خصوصیت کے فیلڈ کی ایک قیمت ہونی چاہئے۔',
  'gt' => 
  array (
    'array' => ': خاصیت میں اس سے زیادہ ہونا چاہئے: ویلیو آئٹمز۔',
    'file' => ': خاصیت اس سے زیادہ ہونی چاہئے: ویلیو کلو بائٹ۔',
    'numeric' => ': خاصیت اس سے زیادہ ہونی چاہئے: قدر۔',
    'string' => ': خاصیت اس سے زیادہ ہونی چاہئے: قدر کے حرف۔',
  ),
  'gte' => 
  array (
    'array' => 'اس: وصف میں ہونا ضروری ہے: ویلیو آئٹمز یا زیادہ۔',
    'file' => ': خصوصیت اس سے زیادہ یا مساوی ہونی چاہئے: ویلیو کلو بائٹ۔',
    'numeric' => ': خصوصیت اس سے زیادہ یا مساوی ہونی چاہئے۔',
    'string' => ': خاصیت سے زیادہ یا مساوی ہونا چاہئے: قدر حروف۔',
  ),
  'image' => ': خصوصیت ایک شبیہہ ہونی چاہئے۔',
  'in' => 'منتخب کردہ: وصف غلط ہے۔',
  'in_array' => ': انتساب فیلڈ میں موجود نہیں ہے: دوسرے۔',
  'integer' => ': خصوصیت کا ایک عدد صحیح ہونا چاہئے۔',
  'ip' => ': خاصیت ایک درست IP پتہ ہونا چاہئے۔',
  'ipv4' => ': خصوصیت ایک درست IPv4 پتہ ہونا چاہئے۔',
  'ipv6' => ': خصوصیت ایک درست IPv6 پتہ ہونا چاہئے۔',
  'json' => ': خاصیت ایک درست JSON سٹرنگ ہونی چاہئے۔',
  'lt' => 
  array (
    'array' => ': خاصیت میں کم قیمت ہونی چاہ.۔',
    'file' => ': خصوصیت کم سے کم ہونی چاہئے: ویلیو کلو بائٹ۔',
    'numeric' => ': خصوصیت کم سے کم ہونی چاہئے: قدر۔',
    'string' => ': خاصیت کم سے کم ہونی چاہئے: قدر کے حرف۔',
  ),
  'lte' => 
  array (
    'array' => ': خاصیت میں اس سے زیادہ نہیں ہونا چاہئے: ویلیو آئٹمز۔',
    'file' => ': خصوصیت اس سے کم یا مساوی ہونی چاہئے: ویلیو کلو بائٹ۔',
    'numeric' => ': خاصیت کم یا اس کے برابر ہونی چاہئے: قدر۔',
    'string' => ': خاصیت کم یا اس کے برابر ہونی چاہئے: قدر کے حرف۔',
  ),
  'max' => 
  array (
    'array' => 'اس: وصف میں زیادہ سے زیادہ اشیاء نہیں ہوسکتی ہیں۔',
    'file' => ': انتساب اس سے زیادہ نہیں ہوسکتا ہے: زیادہ سے زیادہ کلو بائٹ۔',
    'numeric' => ': انتساب اس سے زیادہ نہیں ہوسکتا ہے: زیادہ سے زیادہ۔',
    'string' => ': خاصیت اس سے زیادہ نہیں ہو سکتی ہے: زیادہ سے زیادہ حرف۔',
  ),
  'mimes' => ': خاصیت ایک قسم کی فائل ہونی چاہئے:: اقدار۔',
  'mimetypes' => ': خاصیت ایک قسم کی فائل ہونی چاہئے:: اقدار۔',
  'min' => 
  array (
    'array' => ': وصف میں کم از کم: منٹ آئٹم ہونا ضروری ہے۔',
    'file' => ': خصوصیت کم از کم ہونی چاہئے: کم سے کم کلو بائٹ۔',
    'numeric' => ': وصف کم از کم ہونا چاہئے: منٹ۔',
    'string' => ': وصف کم از کم ہونا چاہئے: کم سے کم حرف۔',
  ),
  'not_in' => 'منتخب کردہ: وصف غلط ہے۔',
  'not_regex' => ': انتساب کی شکل غلط ہے۔',
  'numeric' => ': خصوصیت کی ایک تعداد ہونی چاہئے۔',
  'present' => ': خصوصیت کا فیلڈ موجود ہونا چاہئے۔',
  'regex' => ': انتساب کی شکل غلط ہے۔',
  'required' => ': خصوصیت کا فیلڈ درکار ہے۔',
  'required_if' => ': خصوصیت کا فیلڈ درکار ہوتا ہے جب: دوسرا ہے: ویلیو۔',
  'required_unless' => ': خصوصیت کا فیلڈ اس وقت تک ضروری ہے جب تک: دوسرا اس میں نہیں: اقدار۔',
  'required_with' => 'جب: قدریں موجود ہوں تو: انتساب والے فیلڈ کی ضرورت ہوتی ہے۔',
  'required_with_all' => 'جب: قدریں موجود ہوں تو: انتساب والے فیلڈ کی ضرورت ہوتی ہے۔',
  'required_without' => 'جب: قدریں موجود نہیں ہیں تو: وصف فیلڈ کی ضرورت ہے۔',
  'required_without_all' => ': خاصیت والے فیلڈ کی ضرورت ہوتی ہے جب: کوئی بھی اقدار موجود نہ ہوں۔',
  'same' => ': اوصاف اور: دوسرے سے ملنا چاہئے۔',
  'size' => 
  array (
    'array' => ': وصف میں ہونا ضروری ہے: سائز کی اشیاء۔',
    'file' => ': وصف ہونا ضروری ہے: سائز کلو بائٹ۔',
    'numeric' => ': خاصیت ہونا ضروری ہے: سائز۔',
    'string' => 'اس: وصف کا ہونا ضروری ہے: سائز حروف۔',
  ),
  'starts_with' => ': خصوصیت کا آغاز مندرجہ ذیل میں سے کسی ایک سے ہونا چاہئے:: اقدار',
  'string' => 'The: وصف لازمی تار کا ہونا ضروری ہے۔',
  'timezone' => ': وصف ایک درست زون ہونا چاہئے۔',
  'unique' => 'the: وصف پہلے ہی لیا گیا ہے۔',
  'uploaded' => ': وصف منسوب کرنے میں ناکام۔',
  'url' => ': انتساب کی شکل غلط ہے۔',
  'uuid' => ': وصف ایک درست UID ہونا چاہئے۔',
);
