app/Http/Controllers/Auth/LoginController.php

    public function resendOtp( Request $request ) {

        $validator = Validator::make($request->all(), [
            'email' => 'required|email|exists:users,email',
            'mobile' => 'required|exists:users,mobile',
            'confirmation_code' => 'required',
        ]);

        if ( ! $validator->passes() ) {
          return response()->json(['error'=>$validator->errors()->all()]);
        }

        $email = $request->email;
        $confirmation_code = $request->confirmation_code;
        $mobile = $request->mobile;

        $record = User::where('email', $email)->where('confirmation_code', $confirmation_code)->where('mobile', $mobile)->first();
---
select * from `users` where `email` = 'AdamDMaxwell@jourrapide.com' and `confirmation_code` = 'HHULqw30FX4wcQSzLxyQhsCdd0OZ9R' and `mobile` = '4095558844' limit 1