app/Notifications/WL_EmailNotification.php

select * from `email_templates` where `key` = 'invoice-payment-success' limit 1
---
    public function toMail($notifiable)
    {
        $template = $this->data['template'];
        $template = EmailTemplate::where('key', '=', $template)->first();

select * from `email_templates` where `title` = 'header' limit 1
select * from `email_templates` where `title` = 'footer' limit 1
---
    public function getTemplate($template, $data)
    {

        $header = EmailTemplate::where('title', '=', 'header')->first();
        $footer = EmailTemplate::where('title', '=', 'footer')->first();