routes/web.php

select * from `languages` where `code` = 'hi' limit 1
---
        return view('auth.login');
    });

Route::get('language/{lang}', function ($lang) {

    if ( isDemo() ) {
         return prepareBlockUserMessage( 'info', 'crud_disabled' );
        }

    $direction = 'ltr';
    $code = 'en';
    $language = \App\Language::where('code', '=', $lang)->first();
    if ( $language ) {
        $code= $language->code;
        if ('Yes' === $language->is_rtl) {
          $direction = 'rtl';
        }
    }

    return redirect()->back()
        ->withCookie(cookie()->forever('language', $lang))
        ->withCookie(cookie()->forever('direction', $direction));

})->name('admin.language');