app/Helpers.php

function updateLanguages()
{
  $session_languages = \App\Language::select(['code', 'language', 'is_rtl'])->get()->toArray();
---
select `code`, `language`, `is_rtl` from `languages`

function updateLocalSettings( $module = '' )
{
  $default_currency = $user_currency = App\Currency::where('is_default', 'yes')->first();
  if ( ! $default_currency ) {
    $default_currency = $user_currency = App\Currency::where('id', DEFAULT_CURRENCY_ID)->first();
  }
  $default_currency = $default_currency->toArray();
  $contact = \App\User::where( 'id', Auth::id())->first();
  if ( $contact && $contact->currency ) {
      $user_currency = $contact->currency->toArray();
  }

  $currencies = App\Currency::where('status', 'Active')->get();
  $currencies_arr = [];
  if ( $currencies->count() > 0 ) {
---
select * from `users` where `id` = 1 limit 1
select * from `currencies` where `currencies`.`id` = 1 and `currencies`.`status` = 'Active' order by `currencies`.`id` desc limit 1
select * from `currencies` where `status` = 'Active' and `currencies`.`deleted_at` is null and `currencies`.`status` = 'Active' order by `currencies`.`id` desc

function getDefaultCurrency( $type = 'symbol', $customer_id = '' ) {

  if ( ! isAdmin() && ! isAgent() ) {
    $customer_id = Auth::id();
  }
  $symbol = getLocalSetting('default_currency', 'symbol');
  $display_currency = App\Settings::getSetting('display_currency', 'currency_settings', 'symbol');
  if( 'id' === $type ) {
    $symbol = getLocalSetting('default_currency', 'id', DEFAULT_CURRENCY_ID);
  } elseif ( ( 'code' === $display_currency ) || ( 'code' === $type ) ) {
    $symbol = getLocalSetting('default_currency', 'code', '$');
  }

  if ( ! empty( $customer_id ) ) {
    $contact = \App\User::where( 'id', $customer_id)->first();
---
select * from `users` where `id` = 41 limit 1