app/InternalNotification.php

    public static function getRecordWithId($id)
    {
        return InternalNotification::where('id', '=', $id)->first();
---
select * from `internal_notifications` where `id` = '9' limit 1