app/Property.php

   public static function getRecordWithSlug($slug)
    {
        return Property::with(['property_amenities'])->where('slug', '=', $slug)->first();
---
select * from `properties` where `slug` = 'dedicated-props' limit 1
select `amenities`.*, `property_amenities`.`property_id` as `pivot_property_id`, `property_amenities`.`amenity_id` as `pivot_amenity_id` from `amenities` inner join `property_amenities` on `amenities`.`id` = `property_amenities`.`amenity_id` where `property_amenities`.`property_id` in (13)