app/SpaceType.php

select * from `space_types` where `parent_id` = 1
select `space_type_membership_fees`.*, `space_type_membership_fees`.`space_type_id` as `pivot_space_type_id`, `space_type_membership_fees`.`membership_fee_id` as `pivot_membership_fee_id` from `membership_fees` inner join `space_type_membership_fees` on `membership_fees`.`id` = `space_type_membership_fees`.`membership_fee_id` where `space_type_membership_fees`.`space_type_id` in (11, 12, 13)
---
   public static function getSpaceTypes($parentId = 0)
    {
    return SpaceType::with(['space_type_membership_fees'])->where('parent_id','=', $parentId)->get();