app/User.php

select * from `users` where `id` = '24' limit 1
---
   public static function getRecordWithSlug($id)
    {
        return User::where('id', '=', $id)->first();