app/Http/Controllers/BlogController.php

    public function blog(  $sub_space_type_id = '' )
    {

     $records = \App\Article::with(['sub_space_type'])->orderBy('created_at', 'desc')->paginate(6);

    if ( ! empty( $sub_space_type_id )  ) {

       $records = \App\Article::where( 'sub_space_type_id', $sub_space_type_id )->paginate(6);
---
select * from `articles` order by `created_at` desc limit 6 offset 0
select * from `space_types` where `space_types`.`id` in (11, 13, 15, 17)
select count(*) as aggregate from `articles`
select * from `articles` where `sub_space_type_id` = '17' limit 6 offset 0
select count(*) as aggregate from `articles` where `sub_space_type_id` = '17'

     public function eachArticle( $id )
    {

      $records = \App\Article::where('id', '=', $id)->first();
---
select * from `articles` where `id` = '1' limit 1