app/Http/Controllers/DashboardController.php

    public function dashboard()
    {

        $active_class = 'dashboard';
        //Admin
        $latest_registered_users = User::orderBy('id', 'desc')->take(5)->get();
        $latest_properties = Property::orderBy('id', 'desc')->take(5)->get();
        //Customer
        $customer_latest_inquiries = \App\Enquire::where('customer_id', getContactId())->orderBy('id', 'desc')->latest()->take(5)->get();

        $customer_latest_unpaid_invoices = \App\Invoice::where('customer_id', getContactId())->where('paymentstatus','unpaid')->orderBy('id', 'desc')->get();


         //Landlord
         $latest_landlord_properties = Property::where('customer_id', getContactId())->orderBy('id', 'desc')->take(5)->get();
         //Agent
         $latest_agent_assigned_leads = \App\Enquire::where('assigned_to', getContactId())->orderBy('id', 'desc')->take(5)->get();
         $latest_approved_properties = Property::where('is_approved','yes')->orderBy('id', 'desc')->take(5)->get();
---
select * from `users` order by `id` desc limit 5
select * from `properties` order by `id` desc limit 5
select * from `enquires` where `customer_id` = 41 and `customer_id` = 41 order by `id` desc, `created_at` desc limit 5
select * from `invoices` where `customer_id` = 41 and `paymentstatus` = 'unpaid' and `customer_id` = 41 order by `id` desc
select * from `properties` where `customer_id` = 41 order by `id` desc limit 5
select * from `enquires` where `assigned_to` = 1 order by `id` desc limit 5
select * from `properties` where `is_approved` = 'yes' order by `id` desc limit 5