app/Http/Controllers/EnquireAjaxController.php

select * from `email_templates` where `key` = 'booking-initiated' limit 1
---
            }
            elseif ('boo' === $sub)
            {
                $template = EmailTemplate::where('key', '=', $action)->first();