app/Http/Controllers/EnquireController.php

select * from `enquires` where `is_phone_verified` = 'yes' and `deal_lost_no` = 'no' and `junk_lead` = 'no' and `update_status` != 'Deal Completed' order by `updated_at` desc
---
    public function index()
    {


       if( ! ( isAdmin() || isAgent() ) ){
        return redirect()->back();
       }

        if(isAdmin()){
           $items = Enquire::where('is_phone_verified','yes')->where('deal_lost_no','no')->where('junk_lead','no')->where('update_status','!=','Deal Completed')->orderBy('updated_at', 'desc')
                ->get();

select * from `enquires` where `update_status` = 'Booking Initiated' and `is_phone_verified` = 'yes' and `deal_lost_no` = 'no' and `junk_lead` = 'no'
---
    public function bookingInitiatedDetailsIndex()
    {

        if( ! ( isAdmin() || isAgent() ) ){
        return redirect()->back();
       }



        $data = [
                 'items' => Enquire::where('update_status','Booking Initiated')->where('is_phone_verified','yes')->where('deal_lost_no','no')->where('junk_lead','no')->get(),
                 'active_class' => trans('others.enquiries')
                ];

select * from `enquires` where `update_status` = 'Deal Completed' and `is_phone_verified` = 'yes' and `deal_lost_no` = 'no' and `junk_lead` = 'no' order by `updated_at` desc
---
    public function dealsCompleted()
    {
        if( ! ( isAdmin()   || isAgent() || isCustomer()  ) ){
        return redirect()->back();
       }



       $data = [
                 'items' => Enquire::where('update_status','Deal Completed')->where('is_phone_verified','yes')->where('deal_lost_no','no')->where('junk_lead','no')
                 ->latest('updated_at')->get(),
                 'active_class' => trans('others.enquiries')
                ];

select * from `properties` where `properties`.`id` like '%13%'
---
    public function bookingInitiatedFilter(Request $request)
    {

        if (request()->ajax())
        {

            $property_address = request('property_address');
            $property_id = request('property_id');
            $property_company = request('property_company');
            $space_type = request('space_type');

            $active_class = trans('others.enquiries');

            $query = \App\Property::query();


             $query->when($property_address, function ($q, $property_address)
            {
                return $q->where('properties.property_address', 'like', "%$property_address%");
            });

               $query->when($property_company, function ($q, $property_company)
            {
                return $q->where('properties.company', 'like', "%$property_company%");
            });


             $query->when($property_id, function ($q, $property_id)
            {
                return $q->where('properties.id', 'like', "%$property_id%");
            });