app/Http/Controllers/InternalNotificationsController.php

    public function index()
    {

      if( ! ( isAdmin() ) )
       {
            return prepareBlockUserMessage( 'danger', 'not_allowed' );
       }

    $internal_notifications = InternalNotification::all()->sortByDesc('id');
---
select * from `internal_notifications`

    public function read()
    {
        DB::table('internal_notification_user')
            ->where('user_id', Auth::id())
            ->update(['read_at' => Carbon::now()]);
---
update `internal_notification_user` set `read_at` = '2021-02-25 12:56:20' where `user_id` = 43