app/Http/Controllers/InvoiceController.php

select * from `invoices` where `paymentstatus` = 'unpaid' order by `updated_at` desc limit 50 offset 0
select count(*) as aggregate from `invoices` where `paymentstatus` = 'unpaid'
---

       else
       {
            $data =
            [
            'items'         => Invoice::latest('updated_at')->where('paymentstatus', 'unpaid')->paginate(50),
            ];

select * from `invoices` where `id` = '47' and `customer_id` = 41 and `customer_id` = 41 limit 1
---
    public function payNow( Request $request, $id )
    {

       if ( isDemo() ) {
         return prepareBlockUserMessage( 'info', 'crud_disabled' );
        }

      $item = Invoice::where('id', '=', $id)->where('customer_id', '=', getContactId())->first();

select * from `users` where `id` = 41 limit 1
---

       if ( $id > 0 )
       {
         $user = \App\User::where('id', '=', getContactId())->first();

select * from `users` where `id` = 41 limit 1
insert into `payment_history` (`invoice_id`, `description`, `paymentmethod`, `invoice_action`, `slug`, `customer_id`, `paymentstatus`, `updated_at`, `created_at`) values (47, 'test', 'payu', 'deal-completed', 'c03c93b2dbf52d4792c0478e5b97e8d2', 41, 'pending', '2021-02-25 09:58:28', '2021-02-25 09:58:28')
---
    private function preserveBeforeSave( $id , $paymentmethod  ) {
      $user = \App\User::where('id', '=', getContactId())->first();
      $invoice = \App\Invoice::find( $id );
      $payment                   = new PaymentHistory();
      $payment->invoice_id       = $invoice->id;
      $payment->description      = $invoice->description;
      $payment->paymentmethod    = $paymentmethod;
      $payment->invoice_action   = $invoice->action;
      $payment->slug             = md5(microtime() . $invoice->id . rand());
      $payment->customer_id      = $user->id;
      $payment->paymentstatus    = PAYMENT_STATUS_PENDING;

      $payment->save();

update `invoices` set `paymentstatus` = 'paid', `updated_at` = '2021-02-25 10:11:41' where `id` = 46
---
                  $invoice_id = $payment_record->invoice_id;
                  $invoice = \App\Invoice::find( $invoice_id );
                  $invoice->paymentstatus = 'paid';
                  $invoice->save();

select * from `payment_history` where `paymentstatus` = 'success' and `customer_id` = 41 order by `updated_at` desc
---
       public function paidInvoices(Request $request)
      {

        //start
         $invoice_footer_enable = getSetting('invoice-footer-enable', 'invoice-settings');

          $customer_name = $request->customer_name;

          $customer_mobile = $request->customer_mobile;



      if ( ! empty( $customer_name  ) ) {


              $data =
              [
              'items'      =>  PaymentHistory::
                                join('users', 'payment_history.customer_id', '=', 'users.id')
                                ->where('payment_history.customer_id', $customer_name)
                                ->where('paymentstatus','success')
                                ->get(),
              ];