app/Http/Controllers/PropertyController.php

    public function listingIndex(Request $request)
    {

        $title = trans('others.add-new-property');
        $active_class = trans('others.listings');
        $property_manager_name = request('property_manager_name');

        if (isAdmin())
        {
            $items = \App\Property::latest('updated_at')->paginate(PROPERTIES_PER_PAGE);
---
select * from `properties` order by `updated_at` desc limit 50 offset 0
select count(*) as aggregate from `properties`