app/Http/Controllers/SpaceTypesController.php

    public function index( $parent_id = '')
    {

      if ( ! empty( $parent_id ) ) {
        $item = SpaceType::where('parent_id', $parent_id)->get();
        $title = trans('others.back-spacetypes');
        $active_class = trans('others.spacetypes');
      }
      else
      {
        $item = SpaceType::where('parent_id', 0)->get();
---
select * from `space_types` where `parent_id` = 0