app/Http/Controllers/UsersController.php

select * from `roles` where `roles`.`id` in (1, 2, 3, 4)
select * from `users`
---
    public function index()
    {

       if( ! ( isAdmin() ) )
       {
            return prepareBlockUserMessage( 'danger', 'not_allowed' );
       }

        $data =
      [
        'title'         => trans('others.add-new-user'),
        'items'         => User::with(['roles'])->get(),