app/Http/Controllers/Admin/MasterSettingsController.php

    public function index()
    {

        if( ! ( isAdmin() ) )
       {
            return prepareBlockUserMessage( 'danger', 'not_allowed' );
       }

       $master_setting = MasterSetting::all()->sortByDesc('id');
---
select * from `master_settings` where `master_settings`.`deleted_at` is null order by `master_settings`.`id` desc